IntergatedCircuits/STM32_XPD/STM32F3_XPD/inc/xpd_tim.h
/**
  ******************************************************************************
  * @file    xpd_tim.h
  * @author  Benedek Kupper
  * @version 0.4
  * @date    2018-09-15
  * @brief   STM32 eXtensible Peripheral Drivers Timer Module
  *
  * Copyright (c) 2018 Benedek Kupper
  *
  * Licensed under the Apache License, Version 2.0 (the "License");
  * you may not use this file except in compliance with the License.
  * You may obtain a copy of the License at
  *
  *     http://www.apache.org/licenses/LICENSE-2.0
  *
  * Unless required by applicable law or agreed to in writing, software
  * distributed under the License is distributed on an "AS IS" BASIS,
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  */
#ifndef __XPD_TIM_H_
#define __XPD_TIM_H_

#ifdef __cplusplus
extern "C"
{
#endif

#include <xpd_common.h>
#include <xpd_dma.h>
#include <xpd_rcc.h>

#if defined(TIM_CCR5_CCR5) && defined(TIM_CCR6_CCR6)
#define TIM_SUPPORTED_CHANNEL_COUNT   6
#else
#define TIM_SUPPORTED_CHANNEL_COUNT   4
#endif

/** @defgroup TIM
 * @{ */

/** @defgroup TIM_Common TIM Common
 * @{ */

/** @defgroup TIM_Common_Exported_Types TIM Common Exported Types
 * @{ */

/** @brief TIM counter modes */
typedef enum
{
    TIM_COUNTER_UP             = 0, /*!< Timer is counting from 0 to Period - 1 */
    TIM_COUNTER_DOWN           = 1, /*!< Timer is counting from Period - 1 to 0 */
    TIM_COUNTER_CENTERALIGNED1 = 2, /*!< Timer is switching between up- and downcounting,
                                         output channel interrupt is set during down */
    TIM_COUNTER_CENTERALIGNED2 = 4, /*!< Timer is switching between up- and downcounting,
                                         output channel interrupt is set during up */
    TIM_COUNTER_CENTERALIGNED3 = 6  /*!< Timer is switching between up- and downcounting,
                                         output channel interrupt is set during up & down */
}TIM_CounterType;

/** @brief TIM counter setup structure */
typedef struct
{
    uint32_t         Prescaler;         /*!< Clock prescaler for the counter, [1 .. (1 << timer bit size)] */
    uint32_t         Period;            /*!< Counter period, [1 .. (1 << timer bit size)] */
    TIM_CounterType  Mode;              /*!< Counter mode */
    ClockDividerType ClockDivision;     /*!< Division factor for deadtime and sampling clock.
                                             Permitted values: @arg CLK_DIV1 @arg CLK_DIV2 @arg CLK_DIV4 */
    uint8_t          RepetitionCounter; /*!< Specifies how many counter periods trigger an update
                                             @note Valid only for TIM1 and TIM8. */
    FunctionalState  Preload;           /*!< Reload (Period) is preloaded and only applied after an update (ARPE) */
    FunctionalState  OnePulse;          /*!< After an update counter stops automatically (OPM) */
}TIM_InitType;

/** @brief TIM channels */
typedef enum
{
    TIM_CH1 = 0, /*!< TIM channel 1 */
    TIM_CH2 = 1, /*!< TIM channel 2 */
    TIM_CH3 = 2, /*!< TIM channel 3 */
    TIM_CH4 = 3, /*!< TIM channel 4 */
#if TIM_SUPPORTED_CHANNEL_COUNT > 5
    TIM_CH5 = 4, /*!< TIM channel 5 (limited capabilities: no IT or DMA) */
    TIM_CH6 = 5  /*!< TIM channel 6 (limited capabilities: no IT or DMA) */
#endif
}TIM_ChannelType;

/** @brief TIM output modes */
typedef enum
{
    TIM_OUTPUT_TIMING             = 0x00,   /*!< Output channel is frozen, use for timing base generation */
    TIM_OUTPUT_ACTIVE             = 0x04,   /*!< Output channel is active on match */
    TIM_OUTPUT_INACTIVE           = 0x08,   /*!< Output channel is inactive on match */
    TIM_OUTPUT_TOGGLE             = 0x0C,   /*!< Output channel is toggled on match */
    TIM_OUTPUT_FORCEDINACTIVE     = 0x10,   /*!< Output channel is forced low */
    TIM_OUTPUT_FORCEDACTIVE       = 0x14,   /*!< Output channel is forced high */
    TIM_OUTPUT_PWM1               = 0x1B,   /*!< Output channel is active when CNT < CCR */
    TIM_OUTPUT_PWM2               = 0x1F,   /*!< Output channel is active when CNT > CCR */
#if (TIM_CCMR1_OC1M > 0xFFFF)
    TIM_OUTPUT_RETRIGERRABLE_OPM1 = 0x4000, /*!< Output channel is active after CNT < CCR at the time of trigger reception */
    TIM_OUTPUT_RETRIGERRABLE_OPM2 = 0x4004, /*!< Output channel is active after CNT > CCR at the time of trigger reception */
    TIM_OUTPUT_COMBINED_PWM1      = 0x4013, /*!< As in PWM1, but OC1REFC is the logical OR between OC1REF and OC2REF */
    TIM_OUTPUT_COMBINED_PWM2      = 0x4017, /*!< As in PWM2, but OC1REFC is the logical AND between OC1REF and OC2REF */
    TIM_OUTPUT_ASYMMETRIC_PWM1    = 0x401B, /*!< Output channel is active when CNT > CCR */
    TIM_OUTPUT_ASYMMETRIC_PWM2    = 0x401F, /*!< Output channel is active when CNT > CCR */
#endif
    TIM_OUTPUT_PRELOAD_FLAG       = 0x02,   /*!< Preloaded value is activated at next update event */
}TIM_OutputModeType;

/** @brief TIM input channel sources */
typedef enum
{
    TIM_INPUT_OWN_TI  = 1,  /*!< TIM input n is connected to ICn */
    TIM_INPUT_PAIR_TI = 2,  /*!< TIM input n is connected to IC(n ^ (n & 1)) */
    TIM_INPUT_TRC     = 3,  /*!< TIM input n is connected to TRC */
}TIM_InputSourceType;

/** @brief TIM capture/compare channel setup structure */
typedef union
{
    struct {
        uint32_t Value;         /*!< Channel initial value */
        union {
        struct {
        uint32_t : 2;
#if (TIM_CCMR1_OC1M > 0xFFFF)
        TIM_OutputModeType  Mode : 15;       /*!< Output channel mode */
#else
        TIM_OutputModeType  Mode : 5;        /*!< Output channel mode */
        uint32_t : 10;
#endif
        ActiveLevelType     Polarity : 1;    /*!< Output channel active level */
        FunctionalState     InvChannel : 1;  /*!< Complementary output channel is used */
        ActiveLevelType     InvPolarity : 1; /*!< Complementary output channel active level */
        uint32_t : 4;
        FlagStatus          IdleState : 1;   /*!< Output channel idle state */
        FlagStatus          InvIdleState : 1;/*!< Complementary output channel idle state */
        uint32_t : 6;
        }__packed;
            uint32_t w; /* Internal use only */
        };
        TIM_ChannelType Number; /*!< Channel number */
    }OC;                        /*!< Output Compare channel setup */
    struct {
        uint32_t Value;         /*!< Channel initial value */
        union {
        struct {
        TIM_InputSourceType Source : 2;      /*!< Specifies the input source */
        ClockDividerType    Prescaler : 2;   /*!< Specifies the input capture prescaler [DIV1..DIV8] */
        uint32_t            Filter : 4;      /*!< Specifies the input capture filter. [0..15] */
        uint32_t : 9;
        ActiveLevelType     Polarity : 1;    /*!< Specifies the active edge of the input signal */
        uint32_t : 14;
        }__packed;
            uint8_t b[4]; /* Internal use only */
        };
        TIM_ChannelType Number; /*!< Channel number */
    }IC;                        /*!< Input Capture channel setup */
}TIM_ChannelInitType;

/** @brief TIM event selection */
typedef enum
{
    TIM_EVENT_UPDATE    = 0, /*!< TIM counter value updated event */
    TIM_EVENT_CH1       = 1, /*!< TIM Capture/Compare channel 1 event */
    TIM_EVENT_CH2       = 2, /*!< TIM Capture/Compare channel 2 event */
    TIM_EVENT_CH3       = 3, /*!< TIM Capture/Compare channel 3 event */
    TIM_EVENT_CH4       = 4, /*!< TIM Capture/Compare channel 4 event */
    TIM_EVENT_COM       = 5, /*!< TIM Capture/Compare control update event */
    TIM_EVENT_TRIGGER   = 6, /*!< TIM Trigger event */
}TIM_EventType;

/** @brief TIM Handle structure */
typedef struct
{
    TIM_TypeDef * Inst;                      /*!< The address of the peripheral instance used by the handle */
#ifdef TIM_BB
    TIM_BitBand_TypeDef * Inst_BB;           /*!< The address of the peripheral instance in the bit-band region */
#endif
    struct {
        XPD_HandleCallbackType DepInit;      /*!< Callback to initialize module dependencies (GPIOs, IRQs, DMAs) */
        XPD_HandleCallbackType DepDeinit;    /*!< Callback to restore module dependencies (GPIOs, IRQs, DMAs) */
        XPD_HandleCallbackType Update;       /*!< Timer update callback */
        XPD_HandleCallbackType ChannelEvent; /*!< Channel compare/capture callback */
        XPD_HandleCallbackType Trigger;      /*!< Trigger callback */
        XPD_HandleCallbackType Commutation;  /*!< Commutation callback */
        XPD_HandleCallbackType Break;        /*!< Break callback */
#ifdef __XPD_DMA_ERROR_DETECT
        XPD_HandleCallbackType Error;        /*!< DMA error callback */
#endif
    }Callbacks;                              /*   Handle Callbacks */
    struct {
        DMA_HandleType * Update;             /*!< DMA handle for update transfer */
        DMA_HandleType * Channel[4];         /*!< DMA handles for channel transfers */
        DMA_HandleType * Burst;              /*!< DMA handle for burst transfers */
    }DMA;                                    /*   DMA handle references */
    RCC_PositionType CtrlPos;                /*!< Relative position for reset and clock control */
    uint32_t ChannelMask;                    /*!< Configured timer channels mask */
    uint8_t  EventMask;                      /*!< Configured timer channels event mask */
    volatile TIM_ChannelType ActiveChannel;  /*!< The currently active timer channel */
}TIM_HandleType;

/** @} */

/** @defgroup TIM_Common_Exported_Macros TIM Common Exported Macros
 * @{ */

#ifdef TIM_BB
/**
 * @brief TIM Instance to handle binder macro
 * @param HANDLE: specifies the peripheral handle.
 * @param INSTANCE: specifies the TIM peripheral instance.
 */
#define         TIM_INST2HANDLE(HANDLE,INSTANCE)            \
    ((HANDLE)->Inst    = (INSTANCE),                        \
     (HANDLE)->Inst_BB = TIM_BB(INSTANCE),                  \
     (HANDLE)->CtrlPos = RCC_POS_##INSTANCE)

/**
 * @brief TIM register bit accessing macro
 * @param HANDLE: specifies the peripheral handle.
 * @param REG_NAME: specifies the register name.
 * @param BIT_NAME: specifies the register bit name.
 */
#define         TIM_REG_BIT(HANDLE, REG_NAME, BIT_NAME)     \
    ((HANDLE)->Inst_BB->REG_NAME.BIT_NAME)

#else
/**
 * @brief TIM Instance to handle binder macro
 * @param HANDLE: specifies the peripheral handle.
 * @param INSTANCE: specifies the TIM peripheral instance.
 */
#define         TIM_INST2HANDLE(HANDLE,INSTANCE)            \
    ((HANDLE)->Inst    = (INSTANCE),                        \
     (HANDLE)->CtrlPos = RCC_POS_##INSTANCE)

/**
 * @brief TIM register bit accessing macro
 * @param HANDLE: specifies the peripheral handle.
 * @param REG_NAME: specifies the register name.
 * @param BIT_NAME: specifies the register bit name.
 */
#define         TIM_REG_BIT(HANDLE, REG_NAME, BIT_NAME)     \
    ((HANDLE)->Inst->REG_NAME.b.BIT_NAME)

