IntergatedCircuits/STM32_XPD/STM32F3_XPD/inc/xpd_tim.h
#endif /* TIM_BB */

/**
 * @brief  Enable the specified TIM interrupt.
 * @param  HANDLE: specifies the TIM Handle.
 * @param  IT_NAME: specifies the interrupt to enable.
 *         This parameter can be one of the following values:
 *            @arg U:       Update
 *            @arg CC1:     Capture/Compare channel 1
 *            @arg CC2:     Capture/Compare channel 2
 *            @arg CC3:     Capture/Compare channel 3
 *            @arg CC4:     Capture/Compare channel 4
 *            @arg COM:     Commutation
 *            @arg T:       Trigger
 *            @arg B:       Break
 */
#define         TIM_IT_ENABLE(HANDLE, IT_NAME)              \
    (TIM_REG_BIT((HANDLE),DIER,IT_NAME##IE) = 1)

/**
 * @brief  Disable the specified TIM interrupt.
 * @param  HANDLE: specifies the TIM Handle.
 * @param  IT_NAME: specifies the interrupt to enable.
 *         This parameter can be one of the following values:
 *            @arg U:       Update
 *            @arg CC1:     Capture/Compare channel 1
 *            @arg CC2:     Capture/Compare channel 2
 *            @arg CC3:     Capture/Compare channel 3
 *            @arg CC4:     Capture/Compare channel 4
 *            @arg COM:     Commutation
 *            @arg T:       Trigger
 *            @arg B:       Break
 */
#define         TIM_IT_DISABLE(HANDLE, IT_NAME)             \
    (TIM_REG_BIT((HANDLE),DIER,IT_NAME##IE) = 0)

/**
 * @brief  Enable the specified TIM DMA request.
 * @param  HANDLE: specifies the TIM Handle.
 * @param  DMA_NAME: specifies the DMA request to enable.
 *         This parameter can be one of the following values:
 *            @arg U:       Update
 *            @arg CC1:     Capture/Compare channel 1
 *            @arg CC2:     Capture/Compare channel 2
 *            @arg CC3:     Capture/Compare channel 3
 *            @arg CC4:     Capture/Compare channel 4
 *            @arg COM:     Commutation
 *            @arg T:       Trigger
 */
#define         TIM_DMA_ENABLE(HANDLE, DMA_NAME)            \
    (TIM_REG_BIT((HANDLE),DIER,DMA_NAME##DE) = 1)

/**
 * @brief  Disable the specified TIM DMA request.
 * @param  HANDLE: specifies the TIM Handle.
 * @param  DMA_NAME: specifies the DMA request to enable.
 *         This parameter can be one of the following values:
 *            @arg U:       Update
 *            @arg CC1:     Capture/Compare channel 1
 *            @arg CC2:     Capture/Compare channel 2
 *            @arg CC3:     Capture/Compare channel 3
 *            @arg CC4:     Capture/Compare channel 4
 *            @arg COM:     Commutation
 *            @arg T:       Trigger
 */
#define         TIM_DMA_DISABLE(HANDLE, DMA_NAME)           \
    (TIM_REG_BIT((HANDLE),DIER,DMA_NAME##DE) = 0)

/**
 * @brief  Get the specified TIM flag.
 * @param  HANDLE: specifies the TIM Handle.
 * @param  FLAG_NAME: specifies the flag to return.
 *         This parameter can be one of the following values:
 *            @arg U:       Update
 *            @arg CC1:     Capture/Compare channel 1
 *            @arg CC2:     Capture/Compare channel 2
 *            @arg CC3:     Capture/Compare channel 3
 *            @arg CC4:     Capture/Compare channel 4
 *            @arg COM:     Commutation
 *            @arg T:       Trigger
 *            @arg B:       Break
 */
#define         TIM_FLAG_STATUS(HANDLE, FLAG_NAME)          \
    (TIM_REG_BIT((HANDLE),SR,FLAG_NAME##IF))

/**
 * @brief  Clear the specified TIM flag.
 * @param  HANDLE: specifies the TIM Handle.
 * @param  FLAG_NAME: specifies the flag to clear.
 *         This parameter can be one of the following values:
 *            @arg U:       Update
 *            @arg CC1:     Capture/Compare channel 1
 *            @arg CC2:     Capture/Compare channel 2
 *            @arg CC3:     Capture/Compare channel 3
 *            @arg CC4:     Capture/Compare channel 4
 *            @arg COM:     Commutation
 *            @arg T:       Trigger
 *            @arg B:       Break
 */
#define         TIM_FLAG_CLEAR(HANDLE,FLAG_NAME)            \
    (TIM_REG_BIT((HANDLE),SR,FLAG_NAME##IF) = 0)

/**
 * @brief Gets or sets the TIM counter direction.
 * @param pxTIM: pointer to the TIM handle structure
 * @return The current counter direction (up/down)
 */
#define         TIM_DIRECTION(HANDLE)                       \
    (TIM_REG_BIT((HANDLE), CR1, DIR))

/** @} */

/** @addtogroup TIM_Common_Exported_Functions
 * @{ */
void            TIM_vInit               (TIM_HandleType * pxTIM, const TIM_InitType * pxConfig,
                                         const TIM_ChannelInitType axChannels[], uint8_t ucChannelCount);
void            TIM_vDeinit             (TIM_HandleType * pxTIM);

void            TIM_vIRQHandler         (TIM_HandleType * pxTIM);

void            TIM_vBurstConfig        (TIM_HandleType * pxTIM,
                                         __IO uint32_t * pulStartReg, uint8_t ucRegCount);

void            TIM_vStart              (TIM_HandleType * pxTIM);
void            TIM_vStop               (TIM_HandleType * pxTIM);

XPD_ReturnType  TIM_eOpen_DMA           (TIM_HandleType * pxTIM, TIM_EventType eEvent,
                                         void * pvAddress, uint16_t usLength);
void            TIM_vClose_DMA          (TIM_HandleType * pxTIM, TIM_EventType eEvent);

/**
 * @brief Provides the current TIM counter reference to get or set its value.
 * @param pxTIM: pointer to the TIM handle structure
 * @return Reference to the counter
 */
__STATIC_INLINE __IO uint32_t* TIM_pulCounter(TIM_HandleType * pxTIM)
{
    return &pxTIM->Inst->CNT;
}

/**
 * @brief Provides the current TIM reload reference to get or set its value.
 * @param pxTIM: pointer to the TIM handle structure
 * @return Reference to the reload
 */
__STATIC_INLINE __IO uint32_t* TIM_pulReload(TIM_HandleType * pxTIM)
{
    return &pxTIM->Inst->ARR;
}

/**
 * @brief Provides the current TIM repetition reference to get or set its value.
 * @param pxTIM: pointer to the TIM handle structure
 * @return Reference to the repetition
 */
__STATIC_INLINE __IO uint32_t* TIM_pulRepetition(TIM_HandleType * pxTIM)
{
    return &pxTIM->Inst->RCR;
}

/**
 * @brief Generate a TIM event.
 * @param pxTIM: pointer to the TIM handle structure
 * @param eEvent: specifies the event to generate
 */
__STATIC_INLINE void TIM_vGenerate(TIM_HandleType * pxTIM, TIM_EventType eEvent)
{
    pxTIM->Inst->EGR.w = 1 << eEvent;
}

/** @} */

/** @} */

/** @defgroup TIM_Counter TIM Counter
 * @{ */

/** @addtogroup TIM_Counter_Exported_Functions
 * @{ */
void            TIM_vCounterInit        (TIM_HandleType * pxTIM, const TIM_InitType * pxConfig);

void            TIM_vCounterStart_IT    (TIM_HandleType * pxTIM);
void            TIM_vCounterStop_IT     (TIM_HandleType * pxTIM);

