IntergatedCircuits/STM32_XPD/STM32F3_XPD/inc/xpd_tim.h
void            TIM_vIRQHandler_UP      (TIM_HandleType * pxTIM);

/**
 * @brief Enables the TIM counter.
 * @param pxTIM: pointer to the TIM handle structure
 */
__STATIC_INLINE void TIM_vCounterStart(TIM_HandleType * pxTIM)
{
    TIM_REG_BIT(pxTIM,CR1,CEN) = 1;
}

/**
 * @brief Disables the TIM counter.
 * @param pxTIM: pointer to the TIM handle structure
 */
__STATIC_INLINE void TIM_vCounterStop(TIM_HandleType * pxTIM)
{
    TIM_REG_BIT(pxTIM,CR1,CEN) = 0;
}

/**
 * @brief Returns the current status of the TIM counter.
 * @param pxTIM: pointer to the TIM handle structure
 * @return TRUE if the counter is running, FALSE if stopped
 */
__STATIC_INLINE boolean_t TIM_bCounterIsRunning(TIM_HandleType * pxTIM)
{
    return TIM_REG_BIT(pxTIM,CR1,CEN);
}

/** @} */

/** @} */

/** @defgroup TIM_Channel TIM Channel Control
 * @{ */

/** @addtogroup TIM_Channel_Exported_Functions
 * @{ */
void            TIM_vIRQHandler_CC      (TIM_HandleType * pxTIM);

/**
 * @brief  Gets or sets the current TIM channel value.
 * @param  HANDLE: specifies the TIM Handle.
 * @param  CH: Number of TIM channel.
 * @return The value of the channel.
 */
__STATIC_INLINE __IO uint32_t* TIM_pulChannel(TIM_HandleType * pxTIM, TIM_ChannelType eChannel)
{
    __IO uint32_t* pulCh = &pxTIM->Inst->CCR1 + eChannel;
#if TIM_SUPPORTED_CHANNEL_COUNT > 5
    if (eChannel > TIM_CH4)
    {
        pulCh += 5;
    }
#endif
    return pulCh;
}

/**
 * @brief Enables the selected capture/compare channel.
 * @param pxTIM: pointer to the TIM handle structure
 * @param eChannel: the channel to enable
 */
__STATIC_INLINE void TIM_vChannelEnable(TIM_HandleType * pxTIM, TIM_ChannelType eChannel)
{
#ifdef TIM_BB
    *(&pxTIM->Inst_BB->CCER.CC1E + (4 * eChannel)) = 1;
#else
    SET_BIT(pxTIM->Inst->CCER.w, TIM_CCER_CC1E << (4 * eChannel));
#endif
}

/**
 * @brief Disables the selected capture/compare channel.
 * @param pxTIM: pointer to the TIM handle structure
 * @param eChannel: the channel to disable
 */
__STATIC_INLINE void TIM_vChannelDisable(TIM_HandleType * pxTIM, TIM_ChannelType eChannel)
{
#ifdef TIM_BB
    *(&pxTIM->Inst_BB->CCER.CC1E + (4 * eChannel)) = 0;
#else
    CLEAR_BIT(pxTIM->Inst->CCER.w, TIM_CCER_CC1E << (4 * eChannel));
#endif
}

/**
 * @brief Enables the selected complementary capture/compare channel.
 * @param pxTIM: pointer to the TIM handle structure
 * @param eChannel: the complementary channel to enable
 */
__STATIC_INLINE void TIM_vInvChannelEnable(TIM_HandleType * pxTIM, TIM_ChannelType eChannel)
{
#ifdef TIM_BB
    *(&pxTIM->Inst_BB->CCER.CC1NE + (4 * eChannel)) = 1;
#else
    SET_BIT(pxTIM->Inst->CCER.w, TIM_CCER_CC1NE << (4 * eChannel));
#endif
}

/**
 * @brief Disables the selected complementary capture/compare channel.
 * @param pxTIM: pointer to the TIM handle structure
 * @param eChannel: the complementary channel to disable
 */
__STATIC_INLINE void TIM_vInvChannelDisable(TIM_HandleType * pxTIM, TIM_ChannelType eChannel)
{
#ifdef TIM_BB
    *(&pxTIM->Inst_BB->CCER.CC1NE + (4 * eChannel)) = 0;
#else
    CLEAR_BIT(pxTIM->Inst->CCER.w, TIM_CCER_CC1NE << (4 * eChannel));
#endif
}

/**
 * @brief Enables the selected capture/compare channel interrupt.
 * @param pxTIM: pointer to the TIM handle structure
 * @param eChannel: the channel to enable
 */
__STATIC_INLINE void TIM_vChannelITEnable(TIM_HandleType * pxTIM, TIM_ChannelType eChannel)
{
    SET_BIT(pxTIM->Inst->DIER.w, TIM_DIER_CC1IE << eChannel);
}

/**
 * @brief Disables the selected capture/compare channel interrupt.
 * @param pxTIM: pointer to the TIM handle structure
 * @param eChannel: the channel to disable
 */
__STATIC_INLINE void TIM_vChannelITDisable(TIM_HandleType * pxTIM, TIM_ChannelType eChannel)
{
    CLEAR_BIT(pxTIM->Inst->DIER.w, TIM_DIER_CC1IE << eChannel);
}

/**
 * @brief Indicates the selected capture/compare channel's interrupt request status.
 * @param pxTIM: pointer to the TIM handle structure
 * @param eChannel: the channel to query
 * @return Status of the interrupt flag
 */
__STATIC_INLINE FlagStatus TIM_vChannelGetFlag(TIM_HandleType * pxTIM, TIM_ChannelType eChannel)
{
    return pxTIM->Inst->SR.w & (TIM_SR_CC1IF << eChannel);
}

/**
 * @brief Clears the selected capture/compare channel's interrupt request.
 * @param pxTIM: pointer to the TIM handle structure
 * @param eChannel: the channel to clear
 */
__STATIC_INLINE void TIM_vChannelClearFlag(TIM_HandleType * pxTIM, TIM_ChannelType eChannel)
{
    CLEAR_BIT(pxTIM->Inst->SR.w, (TIM_SR_CC1IF << eChannel));
}

/** @} */

/** @} */

/** @defgroup TIM_Output TIM Output
 * @{ */

/** @defgroup TIM_Output_Exported_Types TIM Output Exported Types
 * @{ */

/** @brief TIM Main Output drive setup structure */
typedef struct
{
    uint16_t        DeadCounts;      /*!< The dead time between the complementary outputs in deadtime clock counts */
    FunctionalState AutomaticOutput; /*!< Automatic output (MOE is set by software or update event) */
    FunctionalState IdleOffState;    /*!< Off-state selection for Idle mode */
    FunctionalState RunOffState;     /*!< Off-state selection for Run mode */
}TIM_DriveInitType;

/** @brief TIM Break setup structure */
typedef struct
{
    FunctionalState            State;    /*!< Break function state */
    ActiveLevelType            Polarity; /*!< Break input polarity */
#ifdef TIM_BDTR_BKF
    uint8_t                    Filter;   /*!< Break input capture filter */
#endif
}TIM_BreakInitType;

/** @brief TIM OCxREF clear configuration selection */
typedef enum
{
    TIM_OCREFCLEAR_SOURCE_NONE      = 0, /*!< OCxREF clear disabled */
    TIM_OCREFCLEAR_SOURCE_ETR       = 1, /*!< OCxREF cleared by ETRF high level */
#ifdef TIM_SMCR_OCCS
    TIM_OCREFCLEAR_SOURCE_OCREF_CLR = 2, /*!< OCxREF cleared by OCREF_CLR input high level */
#endif
}TIM_OCRefClearSourceType;

/** @brief TIM Commutation trigger source selection */
typedef enum
{
    TIM_COMSOURCE_NONE      = 0,                             /*!< Capture/compare preload disabled */
    TIM_COMSOURCE_SOFTWARE  = 1,                             /*!< Commutate only on software generated event */
    TIM_COMSOURCE_TRGI_ITR0 = 2,                             /*!< Commutate on Internal Trigger 0 */
    TIM_COMSOURCE_TRGI_ITR1 = TIM_SMCR_TS_0,                 /*!< Commutate on Internal Trigger 1 */
    TIM_COMSOURCE_TRGI_ITR2 = TIM_SMCR_TS_1,                 /*!< Commutate on Internal Trigger 2 */
    TIM_COMSOURCE_TRGI_ITR3 = TIM_SMCR_TS_1 | TIM_SMCR_TS_0, /*!< Commutate on Internal Trigger 3 */
}TIM_CommutationSourceType;

/** @} */

/** @addtogroup TIM_Output_Exported_Functions
 * @{ */
void            TIM_vBreakConfig        (TIM_HandleType * pxTIM, uint8_t ucBreakLine,
                                         const TIM_BreakInitType * pxConfig);

void            TIM_vIRQHandler_BRK     (TIM_HandleType * pxTIM);

void            TIM_vDriveConfig        (TIM_HandleType * pxTIM, const TIM_DriveInitType * pxConfig);

void            TIM_vOCRefClearConfig   (TIM_HandleType * pxTIM, TIM_ChannelType eChannel,
                                         TIM_OCRefClearSourceType OCREF_CLR_IN);

void            TIM_vCommutationConfig  (TIM_HandleType * pxTIM,
                                         TIM_CommutationSourceType ComSource);

void            TIM_vIRQHandler_COM     (TIM_HandleType * pxTIM);

/**
 * @brief Sets the selected lock level to write-protect certain timer configuration registers.
 * @param pxTIM: pointer to the TIM handle structure
 * @param LockLevel: the specified lock level to apply [0..3]
 */
__STATIC_INLINE void TIM_vLockConfig(TIM_HandleType * pxTIM, uint8_t LockLevel)
{
    pxTIM->Inst->BDTR.b.LOCK = LockLevel;
}

/** @} */

/** @} */

/** @defgroup TIM_Input TIM Input
 * @{ */

