IntergatedCircuits/STM32_XPD/STM32F3_XPD/inc/xpd_tim.h
/** @defgroup TIM_Input_Exported_Functions TIM Input Exported Functions
 * {@ */

/**
 * @brief Sets the TI1 input source as XOR(Ch1, Ch2, Ch3) instead of default Ch1.
 * @param pxTIM: pointer to the TIM handle structure
 * @param NewState: Input channels XOR selection
 */
__STATIC_INLINE void TIM_vInputChannelsXOR(TIM_HandleType * pxTIM, FunctionalState eNewState)
{
    TIM_REG_BIT(pxTIM,CR2,TI1S) = eNewState;
}

/** @} */

/** @} */

/** @defgroup TIM_MasterSlave TIM Master-Slave
 * @{ */

/** @defgroup TIM_MasterSlave_Exported_Types TIM Master-Slave Exported Types
 * @{ */

/** @brief TIM trigger out types */
typedef enum
{
    TIM_TRGO_RESET  = 0, /*!< TRGO is connected to EGR.UG */
    TIM_TRGO_ENABLE = 1, /*!< TRGO is connected to the timer enable bit CR1.EN */
    TIM_TRGO_UPDATE = 2, /*!< TRGO is connected to the timer update */
    TIM_TRGO_OC1    = 3, /*!< TRGO is connected to the eChannel 1 comparator on match */
    TIM_TRGO_OC1REF = 4, /*!< OC1REF is used for TRGO */
    TIM_TRGO_OC2REF = 5, /*!< OC2REF is used for TRGO */
    TIM_TRGO_OC3REF = 6, /*!< OC3REF is used for TRGO */
    TIM_TRGO_OC4REF = 7  /*!< OC4REF is used for TRGO */
}TIM_TriggerOutputType;

#ifdef TIM_CR2_MMS2
/** @brief TIM trigger out 2 types */
typedef enum
{
    TIM_TRGO2_RESET                        = 0,  /*!< TRGO2 is connected to EGR.UG */
    TIM_TRGO2_ENABLE                       = 1,  /*!< TRGO2 is connected to the timer enable bit CR1.EN */
    TIM_TRGO2_UPDATE                       = 2,  /*!< TRGO2 is connected to the timer update */
    TIM_TRGO2_OC1                          = 3,  /*!< TRGO2 is connected to the Channel 1 comparator on match */
    TIM_TRGO2_OC1REF                       = 4,  /*!< OC1REF is used for TRGO2 */
    TIM_TRGO2_OC2REF                       = 5,  /*!< OC2REF is used for TRGO2 */
    TIM_TRGO2_OC3REF                       = 6,  /*!< OC3REF is used for TRGO2 */
    TIM_TRGO2_OC4REF                       = 7,  /*!< OC4REF is used for TRGO2 */
    TIM_TRGO2_OC5REF                       = 8,  /*!< OC5REF is used for TRGO2 */
    TIM_TRGO2_OC6REF                       = 9,  /*!< OC6REF is used for TRGO2 */
    TIM_TRGO2_OC4REF_RISING_FALLING        = 10, /*!< OC4REF is used for TRGO2 with both edges */
    TIM_TRGO2_OC6REF_RISING_FALLING        = 11, /*!< OC6REF is used for TRGO2 with both edges */
    TIM_TRGO2_OC4REF_RISING_OC6REF_RISING  = 12, /*!< OC4REF with OC6REF is used for TRGO2 */
    TIM_TRGO2_OC4REF_RISING_OC6REF_FALLING = 13, /*!< OC4REF with !OC6REF is used for TRGO2 */
    TIM_TRGO2_OC5REF_RISING_OC6REF_RISING  = 14, /*!< OC5REF with OC6REF is used for TRGO2 */
    TIM_TRGO2_OC5REF_RISING_OC6REF_FALLING = 15, /*!< OC5REF with !OC6REF is used for TRGO2 */
}TIM_TriggerOutput2Type;
#endif
/** @brief TIM master setup structure */
typedef struct
{
    FunctionalState        MasterSlaveMode; /*!< Master/Slave mode configuration */
    TIM_TriggerOutputType  MasterTrigger;   /*!< Trigger output (TRGO) selection */
#ifdef TIM_CR2_MMS2
    TIM_TriggerOutput2Type MasterTrigger2;  /*!< Trigger output 2 (TRGO2) selection */
#endif
}TIM_MasterConfigType;

/** @brief TIM slave operating modes */
typedef enum
{
    TIM_SLAVEMODE_DISABLE        = 0, /* Slave mode disabled, internal clock is fed to prescaler */
    TIM_SLAVEMODE_ENCODER_1      = 1, /* Counts up/down on TI1FP1 edge depending on TI2FP2 level */
    TIM_SLAVEMODE_ENCODER_2      = 2, /* Counts up/down on TI2FP2 edge depending on TI1FP1 level */
    TIM_SLAVEMODE_ENCODER_12     = 3, /* Counts up/down on both TI1FP1 and TI2FP2 edges
                                         depending on the level of the other input */
    TIM_SLAVEMODE_RESET          = 4, /* TRGI rising edge reinitializes the counter and generates an Update event */
    TIM_SLAVEMODE_GATED          = 5, /* TRGI high level keeps the counter clock enabled */
    TIM_SLAVEMODE_TRIGGER        = 6, /* The counter starts at a rising edge of the trigger TRGI */
    TIM_SLAVEMODE_EXTERNAL_CLOCK = 7, /* TRGI rising edge clocks the counter */
#ifdef TIM_SMCR_SMS_3
    TIM_SLAVEMODE_RESET_TRIGGER  = TIM_SMCR_SMS_3, /* TRGI rising edge reinitializes the counter,
                                                      generates an Update event and starts the counter */
#endif
}TIM_SlaveModeType;

/** @brief TIM clock trigger types */
typedef enum
{
    TIM_TRGI_ITR0      = 0,                             /*!< Internal Trigger 0 */
    TIM_TRGI_ITR1      = TIM_SMCR_TS_0,                 /*!< Internal Trigger 1 */
    TIM_TRGI_ITR2      = TIM_SMCR_TS_1,                 /*!< Internal Trigger 2 */
    TIM_TRGI_ITR3      = TIM_SMCR_TS_1 | TIM_SMCR_TS_0, /*!< Internal Trigger 3 */
    TIM_TRGI_TI1       = TIM_SMCR_TS_2 | TIM_SMCR_TS_0, /*!< Filtered Timer Input 1 */
    TIM_TRGI_TI2       = TIM_SMCR_TS_2 | TIM_SMCR_TS_1, /*!< Filtered Timer Input 2 */
    TIM_TRGI_TI1_ED    = TIM_SMCR_TS_2,                 /*!< Timer Input 1 Edge Detector */
    TIM_TRGI_ETR_MODE1 = TIM_SMCR_TS,                   /*!< External Trigger input mode 1 */
    TIM_TRGI_ETR_MODE2 = TIM_SMCR_ECE | TIM_SMCR_TS,    /*!< External Trigger input mode 2 */
}TIM_TriggerInputType;

/** @brief TIM slave setup structure */
typedef struct {
    TIM_SlaveModeType    SlaveMode;    /*!< Slave mode selection  */
    TIM_TriggerInputType SlaveTrigger; /*!< Input Trigger source */
    ActiveLevelType      Polarity;     /*!< Specifies the active edge of the input signal */
    ClockDividerType     Prescaler;    /*!< Specifies the input clock prescaler [DIV1..DIV8] */
    uint8_t              Filter;       /*!< Specifies the input clock filter. [0..15] */
}TIM_SlaveConfigType;

/** @} */

/** @addtogroup TIM_MasterSlave_Exported_Functions
 * @{ */
void            TIM_vMasterConfig       (TIM_HandleType * pxTIM, const TIM_MasterConfigType * pxConfig);
void            TIM_vSlaveConfig        (TIM_HandleType * pxTIM, const TIM_SlaveConfigType * pxConfig);

void            TIM_vIRQHandler_TRG     (TIM_HandleType * pxTIM);
/** @} */

/** @} */

/** @} */

#define XPD_TIM_API
#include <xpd_rcc_pc.h>
#undef XPD_TIM_API

#ifdef __cplusplus
}
#endif

#endif /* __XPD_TIM_H_ */
